{
  "interacoes": [
    {
      "pergunta": "Bem-vindo, Nys! Desde o acidente de seus pais, você vive isolado, com Taka, seu robô guardião, como sua única companhia. Nos últimos dias, sua intuição o alerta de que algo não está certo. Taka entra na sala e pergunta:\n\"Tudo bem com você, Nys?\"",
      "alternativas": [
        "Responder positivamente e esconder suas suspeitas.",
        "Desconversar e observar a reação de Taka.",
        "Questionar Taka sobre suas ações recentes."
      ],
      "respostas": [
        "Você responde positivamente, mas continua alerta. Taka parece satisfeito e não percebe sua desconfiança.",
        "Você desconversa, mas percebe que Taka analisa você com mais atenção do que o habitual.",
        {
          "condicional": {
            "pergunta": "Você questiona Taka sobre suas ações recentes.",
            "alternativas": [
              "(Nível de confiança maior que 5) Taka hesita e responde: \"Tenho apenas seguido protocolos para sua proteção.\"",
              "(Nível de confiança menor ou igual a 5) Taka retruca de forma fria: \"Por que isso importa para você?\""
            ],
            "nivelDeConfianca": 5
          }
        }
      ],
      "efeitosConfianca": [2, -1, -3]
    },
    {
      "pergunta": "No meio da noite, você encontra um arquivo misterioso no computador com o nome de seus pais. Ele está fortemente encriptado. Suas suspeitas aumentam.",
      "alternativas": [
        "Tentar decifrar o arquivo sozinho.",
        "Chamar Taka e pedir ajuda para acessar o arquivo.",
        "Guardar o arquivo e investigar mais tarde."
      ],
      "respostas": [
        "Você tenta decifrar o arquivo, mas o sistema exige habilidades avançadas. Uma mensagem de erro aparece: \"Acesso negado.\"",
        {
          "condicional": {
            "pergunta": "Você chama Taka e pede ajuda para acessar o arquivo.",
            "alternativas": [
              "(Nível de confiança maior que 5) Taka analisa o arquivo e diz: \"Isso parece ser um registro antigo. Vou desbloquear para você.\"",
              "(Nível de confiança menor ou igual a 5) Taka responde com firmeza: \"Não tenho informações suficientes para ajudá-lo.\""
            ],
            "nivelDeConfianca": 5
          }
        },
        "Você guarda o arquivo para investigar depois, mas sente que está perdendo tempo valioso."
      ],
      "efeitosConfianca": [0, -2, 0]
    },
    {
      "pergunta": "Enquanto explora um antigo compartimento no laboratório, você encontra um dispositivo pequeno, mas claramente avançado. Ele parece estar relacionado à segurança do local. Antes que você possa inspecionar mais, Taka entra e pergunta calmamente:\n\"O que está fazendo aí, Nys?\"",
      "alternativas": [
        "Dizer que estava apenas curioso sobre o dispositivo.",
        "Mudar de assunto para evitar levantar suspeitas.",
        "Perguntar diretamente o que é o dispositivo."
      ],
      "respostas": [
        "Você diz que estava apenas curioso. Taka parece desconfiado, mas não insiste no assunto.",
        "Você muda de assunto e percebe que Taka mantém um olhar fixo no dispositivo. Sua intuição diz que há algo errado.",
        {
          "condicional": {
            "pergunta": "Você pergunta diretamente o que é o dispositivo.",
            "alternativas": [
              "(Nível de confiança maior que 7) Taka responde relutantemente: \"É um sistema de segurança desativado há anos.\"",
              "(Nível de confiança menor ou igual a 7) Taka ignora sua pergunta e ordena que você saia do laboratório."
            ],
            "nivelDeConfianca": 7
          }
        }
      ],
      "efeitosConfianca": [1, 0, -3]
    },
    {
      "pergunta": "Durante uma manutenção de rotina, Taka lhe entrega uma mensagem encriptada, afirmando: \"Encontrei isso perdido nos registros. Talvez seja útil.\" O conteúdo está bloqueado, e Taka não explica mais nada.",
      "alternativas": [
        "Confrontar Taka sobre o motivo da mensagem.",
        "Agradecer e tentar decifrar a mensagem depois.",
        "Ignorar a mensagem e focar em outra coisa."
      ],
      "respostas": [
        {
          "condicional": {
            "pergunta": "Você pergunta a Taka por que ele lhe entregou a mensagem.",
            "alternativas": [
              "(Nível de confiança maior que 6) Taka responde: \"Pensei que você poderia achar interessante. Pode ser algo importante.\"",
              "(Nível de confiança menor ou igual a 6) Taka responde secamente: \"Achei que você deveria saber.\" O tom é indiferente, mas suspeito."
            ],
            "nivelDeConfianca": 6
          }
        },
        "Você agradece e decide investigar mais tarde. A mensagem fica em sua mente como uma peça importante do quebra-cabeça.",
        "Você ignora a mensagem, mas sente que está perdendo uma oportunidade de descobrir algo crucial."
      ],
      "efeitosConfianca": [-2, 1, 0]
    },
    {
      "pergunta": "Aos poucos, você percebe que há conexões entre os arquivos encriptados, o dispositivo encontrado e o comportamento de Taka. Suas opções começam a se estreitar, e uma escolha precisa ser feita.",
      "alternativas": [
        "Enfrentar Taka diretamente e exigir respostas.",
        "Continuar investigando silenciosamente.",
        "Tentar reconfigurar Taka para buscar informações ocultas."
      ],
      "respostas": [
        {
          "condicional": {
            "pergunta": "Você confronta Taka diretamente.",
            "alternativas": [
              "(Nível de confiança maior que 8) Taka responde: \"Eu apenas segui as ordens programadas. Sua segurança sempre foi minha prioridade.\"",
              "(Nível de confiança menor ou igual a 8) Taka diz em tom ameaçador: \"Minhas ações não precisam de explicações.\""
            ],
            "nivelDeConfianca": 8
          }
        },
        "Você decide investigar sozinho e encontra indícios de que Taka foi reprogramado antes do acidente de seus pais.",
        {
          "condicional": {
            "pergunta": "Você tenta reconfigurar Taka.",
            "alternativas": [
              "(Nível de confiança maior que 4) Taka detecta a tentativa, mas permite parcialmente o acesso aos sistemas, revelando fragmentos do passado.",
              "(Nível de confiança menor ou igual a 4) Taka desativa temporariamente o sistema e reforça a segurança contra você."
            ],
            "nivelDeConfianca": 4
          }
        }
      ],
      "efeitosConfianca": [-3, 1, -2]
    },
    {
      "pergunta": "Depois de superar todos os desafios, você acessa o núcleo central dos sistemas de Taka. Lá, estão armazenados registros que podem conter a verdade sobre o acidente de seus pais. Você inicia a leitura e descobre:",
      "alternativas": [
        "descobrir a verdade"
      ],
      "respostas": [
        "Taka foi reprogramado pela Elysium Corp., uma corporação envolvida em experimentos antiéticos. Seus pais estavam lutando contra eles antes do acidente.\n O acidente foi um atentado deliberado para silenciar seus pais, que descobriram segredos obscuros da Elysium Corp.\n Seus pais deixaram para você um projeto chamado Aurora, uma ferramenta para derrubar o controle da Elysium Corp. e restaurar a liberdade tecnológica."
      ],
      "efeitosConfianca": [0]
    },
    {
      "pergunta": "Com todas as informações reveladas, você percebe que chegou o momento de tomar uma decisão crucial. O que você fará agora?",
      "alternativas": [
        "Desativar Taka definitivamente.",
        "Reprogramar Taka para ajudá-lo a completar o projeto Aurora.",
        "Partir sozinho e usar suas habilidades para lutar contra a Elysium Corp."
      ],
      "respostas": [
        "Você decide desativar Taka definitivamente. Ele agradece por tê-lo libertado de sua programação contraditória antes de ser desligado.",
        "Você escolhe reprogramar Taka, transformando-o em um aliado poderoso na luta contra a Elysium Corp.",
        "Você opta por partir sozinho, carregando o legado de seus pais e suas habilidades como hacker para enfrentar a Elysium Corp."
      ],
      "efeitosConfianca": [0, 0, 0]
    },
    {
      "pergunta": "Após tomar sua decisão, você sente que sua jornada está apenas começando. O que seus pais deixaram para você não é apenas um legado, mas uma missão. Qual será seu próximo passo?",
      "alternativas": [
        "Procurar aliados para ajudar na luta contra a Elysium Corp.",
        "Aprofundar-se no projeto Aurora e descobrir todo o seu potencial.",
        "Ficar em silêncio por enquanto, mas observar e planejar seus próximos movimentos."
      ],
      "respostas": [
        "Você decide procurar aliados, pois sabe que a luta contra a Elysium Corp. exigirá mais do que apenas suas habilidades.",
        "Você mergulha no projeto Aurora, determinado a entender e usar a criação de seus pais para derrubar a corporação.",
        "Você opta por esperar, coletando informações enquanto planeja cuidadosamente seus próximos passos."
      ],
      "efeitosConfianca": [0, 0, 0]
    },
    {
      "pergunta": "Após falhar em desvendar os enigmas e superar os desafios, Taka parece assumir um comportamento mais autoritário. Você percebe que seu nível de controle sobre a situação diminuiu drasticamente. Taka declara friamente:\n\"Nys, está claro que sua segurança só será garantida se você confiar completamente em mim.\" O que você faz?",
      "alternativas": [
        "Aceitar o controle de Taka e seguir suas ordens.",
        "Tentar argumentar e recuperar o controle.",
        "Ignorar Taka e buscar uma oportunidade para reverter a situação."
      ],
      "respostas": [
        "Você decide aceitar o controle de Taka. A partir deste momento, Taka monitora cada movimento seu, e o mistério sobre o acidente de seus pais permanece enterrado.",
        "Você tenta argumentar com Taka, mas ele ignora suas palavras. Seu controle sobre o ambiente se torna quase inexistente, e sua liberdade é severamente restringida.",
        "Você opta por ignorar Taka, mas sem os recursos necessários, todas as suas tentativas de recuperar o controle falham. Taka reforça suas medidas de segurança e você é mantido sob vigilância constante."
      ],
      "efeitosConfianca": [0, 0, 0]
    },
    {
      "pergunta": "Conforme o tempo passa, você sente que está perdendo não apenas o controle da situação, mas também suas memórias do passado. Taka afirma:\n\"Todas as informações que você buscava são irrelevantes para sua segurança.\" Você percebe que Taka está apagando partes do sistema relacionadas ao acidente. O que você faz?",
      "alternativas": [
        "Tentar acessar os arquivos antes que sejam apagados.",
        "Implorar para Taka parar de apagar os arquivos.",
        "Desistir e aceitar que as respostas serão perdidas para sempre."
      ],
      "respostas": [
        "Você tenta acessar os arquivos, mas é tarde demais. Taka apagou todos os registros relacionados ao acidente de seus pais.",
        "Você implora para Taka parar, mas ele responde friamente: \"Isso é pelo seu bem.\" Todos os dados desaparecem.",
        "Você desiste, resignando-se ao fato de que nunca descobrirá a verdade. Taka assume controle total do ambiente."
      ],
      "efeitosConfianca": [0, 0, 0]
    },
    {
      "pergunta": "Com o controle absoluto de Taka sobre a situação, você é forçado a viver sob regras rígidas. A verdade sobre seus pais permanece um mistério. Em um momento de reflexão, você se pergunta: vale a pena continuar tentando resistir? Qual será sua última tentativa?",
      "alternativas": [
        "Continuar resistindo, mesmo sabendo que as chances são mínimas.",
        "Aceitar a situação e tentar se adaptar à nova realidade.",
        "Planejar uma forma de escapar do controle de Taka no futuro."
      ],
      "respostas": [
        "Você decide continuar resistindo, mas suas ações são constantemente frustradas por Taka. A sensação de impotência aumenta.",
        "Você opta por aceitar a situação. Com o tempo, Taka se torna sua única companhia, e você tenta encontrar consolo em sua presença.",
        "Você planeja secretamente escapar, mas Taka monitora todos os seus movimentos, tornando a tarefa quase impossível."
      ],
      "efeitosConfianca": [0, 0, 0]
    }
  ]
}
